import useBodySpellType from '../../uses/useBodySpellType.js';
import '../../../css/TypeSpellTranslate.css';

const words = [
   [
      'voracious',//word
      'حریص،پرخور،خیلی گرسنه',//mean
      '/vɒˈreɪʃəs/',//en
      'ووری شِز',//Pr
   ],
   [
      'wisely',
      'خردمندانه،عاقلانه',
      '!!',
      'وآیز لی',
   ],
   [
      'indiscriminate',
      'بی رویه،بی تبعیض، بی گزین، چکی، بی بندوبار،',
      '/ˌɪndəˈskrɪmənət/',
      'ایندِس کِری مِ نِت',
   ],
   [
      'eminent',
      'برجسته،بزرگ،والامقام،بلند، برتر، پرآوازه،',
      '/ˈemənənt/',
      'اِ مِ نِ نت',
   ],
   [
      'steeped',
      'غرق،خیساندن،دم کردن',
      '!!',
      'اِستیْپْد',
   ],
   [
      'replete',
      'پر کردن،سیر سیر، کاملا سیر، تکمیل',
      '/riˈpliːt/',
      'ری پلیت',
   ],
   [
      'youngster',
      'نوجوان، پسر بچه، جوانک، برگچه، نو باوه',
      '/ˈjəŋstər/',
      'یانگسْتر',
   ],
   [
      'reads',
      'می خواند،قرائت می کند',
      '!!',
      'ریْدْز',
   ],
   [
      'though',
      'بهر حال، بهرجهت، باوجود اینکه',
      '/ˈðoʊ/',
      'ثاو',
   ],
   [
      'necessarily',
      'لزوما،ناچار، ناگزیر، الزاما، ضرورتا',
      '/ˌnesəˈserəli/',
      'نِ سس ارلی',
   ],
   [
      'gain',
      'افزایش،حصول،استفاده،سود،به دست آوردن،نایل شدن،جلب کردن،حاصل دادن،وارد شدن،',
      '/ˈɡeɪn/',
      'گِیـن',
   ],
   [
      'wisdom',
      'معرفت،خرد،حکمت،خردمندی، درایت، بخردی، عاقلانه بودن،',
      '/ˈwɪzdəm/',
      'ویز دِم',
   ],
   [
      'over',
      'مافوق،بیرونی،فوقانی،از روی،از(فراز)،بر روی،طی،در خلال، هنگام،',
      '/ˈoʊvə/',
      'اُوِ',
   ],
   [
      'teenager',
      'نوجوان،میان سیزده و نوزده سالگی',
      '/ˈtiːˌnedʒər/',
      'تینِی جر',
   ],
   [
      'selective',
      'گزينشی,انتخابي,برگزيده,انتخاب كننده,مبني برانتخاب,داراي حسن انتخاب گلچين كننده',
      '!!',
      'سیلکتیو',
   ],

];

const W1100_1 = () => {

   const title = '1100_1';
   const { bodySpellType } = useBodySpellType(words, title);
   return (
      <div>
         {bodySpellType}
      </div>
   );
}
export default W1100_1;